package level01.task01.task0111;

/*
Одной переменной недостаточно

Требования:
1. Объяви две переменные типа int.
2. Объяви одну переменную типа String.
3. Имена переменных типа int должны быть a и b.
4. Имя переменной типа String должно быть s.
5. Переменным сразу должны быть присвоены значения.
6. Переменные a и b должны иметь разные значения.
*/

public class Solution {
    public static void main(String[] args) {
        //напишите тут ваш код
        int a = 3;
        int b = 5;
        String s = "abc";
    }
}
