package level01.task01.task0101;

/*
Круто быть программистом!

Требования:
1. Программа должна выводить текст.
2. Текст должен начинаться с «Я думаю».
3. Текст должен заканчиваться на «это круто».
4. Текст должен состоять из 39 символов, включая пробелы и знаки препинания.
5. Выводимый текст должен соответствовать заданию.
*/

public class Solution {
    public static void main(String[] args) {
        //напишите тут ваш код
        System.out.println("Я думаю, быть программистом - это круто");
        byte a = 127;
        a++;
        System.out.println(a);
    }
}